examples/ws/BPEL/AirportInfoServices/src/airportInfoRequestor.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="airportInfoRequestor" targetNamespace="http://j2ee.netbeans.org/wsdl/AirportInfoServices/src/airportInfoRequestor"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/AirportInfoServices/src/airportInfoRequestor" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns0="http://schemas.xmlsoap.org/soap/encoding/">
    <types/>
    <message name="airportInfoRequestorOperationRequest">
        <part name="getAirportInformationByCityOrAirportName" type="xsd:string"/>
    </message>
    <message name="airportInfoRequestorOperationResponse">
        <part name="getAirportInformationByCityOrAirportNameResponse" type="xsd:string"/>
    </message>
    <portType name="airportInfoRequestorPortType">
        <operation name="airportInfoRequestorOperation">
            <input name="input1" message="tns:airportInfoRequestorOperationRequest"/>
            <output name="output1" message="tns:airportInfoRequestorOperationResponse"/>
        </operation>
    </portType>
    <binding name="airportInfoRequestorBinding" type="tns:airportInfoRequestorPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="airportInfoRequestorOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/AirportInfoServices/src/airportInfoRequestor"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/AirportInfoServices/src/airportInfoRequestor"/>
            </output>
        </operation>
    </binding>
    <service name="airportInfoRequestorService">
        <port name="airportInfoRequestorPort" binding="tns:airportInfoRequestorBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/airportInfoRequestorService/airportInfoRequestorPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="airportInfoRequestor">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="airportInfoRequestorPortTypeRole" portType="tns:airportInfoRequestorPortType"/>
    </plnk:partnerLinkType>
</definitions>
