examples/ws/BPEL/AirportInfoServicesCA/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:air="http://j2ee.netbeans.org/wsdl/AirportInfoServices/src/airportInfoRequestor">
  <soapenv:Body>
    <air:airportInfoRequestorOperation>
      <getAirportInformationByCityOrAirportName>MONTREAL DORVAL</getAirportInformationByCityOrAirportName>
    </air:airportInfoRequestorOperation>
  </soapenv:Body>
</soapenv:Envelope>